def area(a, b):
    '''
    Возвращает площадь прямоугольника

        Параметры:
            a (float): сторона прямоугольника
            b (float): смежная с ней сторона прямоугольника

        Возвращаемое значение:
            area (float): площадь прямоугольника
    '''

    return a * b


def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника

        Параметры:
            a (float): сторона прямоугольника
            b (float): смежная с ней сторона прямоугольника

        Возвращаемое значение:
            perimeter (float): периметр прямоугольника
    '''
    
    return (a + b) * 2